// pages/knowledge/clean/clean.js
const app = getApp()

Page({
  /**
   * 页面的初始数据
   */
  data: {
    list: [
      [
        [
          "清洁概述：   乳牙长出前，漱口最关键。 所需用品：温开水、消毒纱布一小块。 技术指导：喂完奶后给孩子喝些温开水，相当于漱口。也可以用纱布蘸上温开水给宝宝轻擦牙龈和口腔。牙刷的选择:暂时不需要。牙刷的保养: 暂时不需要。牙膏的选择:暂时不需要。漱口杯的选择：暂时不需要。刷牙方法： 暂时不需要。",
        ],[
          "   乳牙的生长发育主要是在胚胎时期完成，要使宝宝出生后牙齿坚固，从妊娠期起准妈妈就要注意营养和健康，在膳食中添加钙质，防止疾病侵袭和用药（四环素等）不当，避免影响胎儿牙齿的发育，为宝宝具备好牙质打基础。一般来说，孩子刚出生时，口腔内没有牙齿，出生后约6个月，下颌中切牙开始萌出。 新生儿虽没有出牙，但存在许多患龋齿的危险因素，比如链球菌、细菌膜、食物残渣等。口腔是婴儿与外界“打交道”最多的地方，进进出出的东西很多。婴儿口腔中的分泌物特别旺盛。如果不清洗的话，奶瓣等好多食物残渣都留存在口腔里面，容易滋生细菌。 新生宝宝的口腔不需要频繁清洗，每次给宝宝喂完奶后，妈妈可以再给宝宝喝少量温开水，将口腔内残存的奶液冲入消化道，以免食物滞留在口腔中，引起病菌繁殖。",
        ],[
          "   一般宝宝需要在四个月至七个月才会长出牙齿，但是也有少数宝宝在刚刚出生就有牙齿。我们首先要分析出所谓的宝宝长牙到底是生出来的牙齿还是马牙，有的时候看起来婴儿的牙床上长出来的是牙齿，但是其实是一种常在宝宝身上发现的生理现象，一般在一个月左右会自行消失。可以用淘米水和白糖粒给宝宝反复的揉搓，这样既可以让马牙消失的快一点，也可以让宝宝感觉到很舒服。如果排除了牙床上的牙是马牙，而是真正早出的乳牙，那么这个时候宝妈就应该随时观察了，看看这些早出的乳牙有没有松动的痕迹，如果有松动的痕迹应立即拔除，因为婴儿的自控能力还不是很好，口腔粘膜也比较薄，牙齿的反复摩擦会有可能导致口腔粘膜受伤，从而引起溃烂。另外如果宝宝早长的牙并没有松动的痕迹，那么就需要预防宝宝在吃奶的时候，不小心用牙齿咬伤自己的舌头，这样会造成宝宝疼痛，影响宝宝进食。 牙齿生长与骨骼有一定关系，但因胚胎来源不完全相同，牙齿与骨骼的生长不完全平行。出生时乳牙已骨化，乳牙牙孢隐藏在颌骨中，被牙龈覆盖；恒牙的骨化从新生儿期开始，18～ 24个月时第三恒臼齿已骨化。",
        ],
      ],
      [
        [
          "清洁概述：乳牙长出期间，爸爸妈妈要每天为孩子清除牙齿上的菌斑、软垢保持口腔清洁，培养孩子的卫生习惯。最好在早上晨起和入睡之前清洁口腔，一天至少清洁两次。  所需用品：消毒纱布或棉签、温开水、指套牙刷。 技术指导：妈妈坐在沙发或床边，让孩子躺在妈妈怀中。妈妈用一只手固定孩子的头部和嘴唇，另一只手拿清洁的纱布或指套牙刷，沾温开水为孩子清洁牙齿的外侧面和内侧面。擦的时候边擦边轻轻按摩孩子的牙龈，帮他缓解长牙带来的不适。牙刷的选择:根据孩子乳牙长出的情况，选择适合的牙刷。如果牙刷的毛出现弯曲，就要更换新牙刷，最迟6到8个星期换一次。 （1）指套牙刷：孩子刚长出1-2颗小牙时使用，把它套在手指上来为孩子刷牙，不仅能洁齿，还能轻轻按摩齿龈。 （2）硅质固齿牙刷：适合在长出2-3颗牙时使用。它有便于宝宝小手握持的牙刷柄，而且刷头弹性良好，软硬适中，就是为让孩子能咬而设计的。既能清除牙上的残渣，又能按摩和保护牙床，完全可满足宝宝这一时期总想咬东西的欲望。安全配件能保证安全。 （3）尖型刷毛的硅质固齿牙刷：适合长出8-11个牙齿后使用，它也同样具有上述所提到的功能。还可用来让孩子来练习刷牙。硅质刷毛也很柔软，不会擦伤孩子娇嫩的齿龈。牙刷的保养: 牙刷使用前后都必须用沸水消毒杀菌，避免细菌残留和滋生。在两次使用之间尽量保持干燥，避免细菌在潮湿的环境中繁殖。牙膏的选择: 暂时不需要。漱口杯的选择：暂时不需要。刷牙方法：  这几种牙刷虽然是硅胶材质，质地比较柔软，但是宝宝乳牙脆弱，妈妈在给宝宝刷牙时不用用力，轻轻擦拭即可。",

        ],[
          "   宝宝在出生6个月后开始慢慢长牙，这时候宝宝的口水会特别多，因为他们正处于长牙的时期。牙龈会很痒，有的宝宝会觉得疼，牙齿要拱出牙龈，这时候可以给宝宝用磨牙棒，促进牙的萌出。可以选择一岁左右的宝宝专用的硅胶牙刷配合可吞食的牙膏来清洁牙膏，同时帮助宝宝养成良好的口腔卫生习惯。",

        ],[
          "    宝宝生后6个月（可早自4个月，晚至10个月）冒出第一颗牙，以后大约每个月冒出1颗新牙，出牙数可概括为一个公式：月龄-4（或6）。 乳牙的萌出很守秩序，顺序是：下面的两颗正中切牙——上面的两颗正中切牙——上面紧邻中切齿的侧切牙——下面的侧切牙。乳牙继续萌出，顺序是：下面两颗第一乳磨牙——上面两颗第一乳磨牙——下面的侧切牙与第一乳磨牙之间的尖牙——上面的尖牙——下面的两颗第二乳磨牙——上面两颗第二乳磨牙。宝宝乳牙的萌出有一个大致时间表，但不固定，并受到遗传、营养、地区等因素的影响，个体差异明显，前后相差半年都属正常，可早自4个月，也可晚至10个月，早产儿更要晚几个月才出牙。只要宝宝身体健康，营养正常，即使晚至1周岁时才出第一个乳牙也没有关系，不必担忧。另外，出牙早晚尚有性别差异，一般女宝宝略早于男宝宝。如果到了1岁还没有出牙迹象，很可能有问题，如患有佝偻病等，需要向医生咨询。出牙是一种生理现象，可能有流口水、牙龈肿胀等不适感，但较轻，如果较重，宝宝总是使劲大哭，也要看医生，弄清是否存在病理情况，并给予正规处理。",

        ],
      ],
      [
        [
          "清洁概述：乳牙长全了，让宝宝了解刷牙的过程和细节，为他日后自己刷牙做好准备。 所需用品：训练牙刷、棉签。  技术指导：孩子可站在或坐在椅凳上，妈妈在孩子的背后或一侧，用一只手固定孩子头部，另一只手握住牙刷沾温开水为孩子刷牙（不用牙膏）。刷牙的顺序是：将牙刷的刷毛放在靠近牙龈部位与牙面呈45度角倾斜，上牙从上向下刷，下牙从下往上刷，刷完外侧面还应刷内侧面和后牙的咬面。每个面要刷15～20次，才能达到清洁牙齿的目的。由于这个时期，乳牙排列较稀疏，牙冠较短，容易造成食物嵌塞。因此，在刷牙前妈妈要先检查孩子的牙缝中有否食物嵌塞，如有嵌塞，应先用棉签将食物清除后再刷牙。 ",

        
          "  另外，要开始训练宝宝自己刷牙了，让他先模仿你的动作，到了2岁，可以试着让他自己刷牙，此时不能要求孩子坚持太长时间，只要让他熟练这些动作就可以。因为你还要按照上面的指导再仔细为他补刷一次。牙刷的选择: 根据孩子乳牙长出的情况，选择适合的牙刷。如果牙刷的毛出现弯曲，就要更换新牙刷，最迟6到8个星期换一次。儿童专用牙刷：小乳牙出齐时使用，可为宝宝选用保健牙刷练习刷牙。它的特点是：刷头小，长度以相当于四颗门牙的宽度为宜，在口内转动灵活，可以刷到所有牙齿的表面；刷毛细而可以进入它间隙柔；刷毛经过磨圆，不刺激齿龈，不损伤牙齿；牙刷柄长短适中，牙刷柄表面最好有一层防滑贴面，易于孩子抓握。",
          "  牙刷的保养:每次刷牙后，牙刷应用流动的水冲洗。因为食物残渣、细菌都会粘附在牙刷上。如果不彻底清洗牙刷，下一次刷牙时没有得到清理的细菌又重新回到口腔中去了。牙刷在两次使用之间必须保持干燥。否则细菌会在潮湿的环境中繁殖。如果牙刷没用多久就有分叉的现象，就表示刷牙太用力了，以后刷牙应该注意。牙膏的选择:最好先不用牙膏刷牙，用牙刷沾温开水刷牙即可。因为牙膏含有各种香味，给宝宝刷牙的时候，会有吞咽牙膏的可能性。3岁前的宝宝控制能力较差，不能很好地通过漱口来清洁口腔，容易把牙膏残留在牙缝中，或者把漱口水、牙膏吞进肚子里。如果一定要使用牙膏，可以选择专为婴幼儿设计的可吞咽牙膏。同时一定注意牙膏使用量，每次使用一颗绿豆大小的量就可以。口腔专家提醒：3岁之前禁止使用含氟牙膏，大部分成人牙膏中都会添加氟化物，而氟化物不能残留在口中，更不能吞咽，否则会影响健康。", 
          "漱口杯的选择： 要选择做工精致，重量较轻的小杯子，尤其是杯口的处理应圆滑，不能划伤孩子的嘴唇。在清洁牙齿时，家长可以选用一些淡盐水给孩子漱口。刷牙方法：  适合2-6岁儿童的刷牙方法是圆弧刷牙法，它简单易学，可以是家长帮助儿童刷牙时使用，也可以是儿童自己学习刷牙时使用。我们一般是从左上后牙的外侧面开始，刷牙时上下牙咬上，然后把牙刷轻轻的放在左上后牙的外侧面，从左上后牙，牙齿与牙龈交接的部位，开始向下画圈，至下颌牙齿与牙龈交界的位置，这样依次画圈向前进行刷牙，右侧牙外侧面重复相同的动作，从后牙到前牙。刷到前牙时，下牙可微微向前伸至上下前牙相对，继续圆弧画圈刷完前牙。 刷牙内侧面，可以从左侧上颌后牙开始，需要大张口，牙刷毛放置于左上后牙内侧面，然后前后往复短距离震颤，幅度一般1-2mm，依次前行至尖牙，以同样的方法，刷右上后牙内侧面，左侧下后牙内侧面，和右侧下后牙内侧面。刷上颌前牙时，可将刷柄竖起，从左侧尖牙开始，上下往复震颤数次，从左至右依次前行至右侧尖牙。 刷牙齿的咬合面时，需要大张口，将刷毛垂直置于牙齿的咬合面，稍用力做前后短距离来回刷。刷牙需要注意，容易忽略的地方有：上颌后牙的外侧面、下颌牙齿的内侧面，以及我们每一侧牙最后的这个位置。  如果帮助儿童刷牙，家长可位于儿童的右后方，并根据儿童的不同年龄和身高，采取抱姿，坐姿或者站姿。",

        ],[
          "    在1.5~3岁这个阶段，孩子的乳牙逐渐长齐，孩子饮食品种的迅速增加，家长要注意控制宝宝甜点和甜饮料的摄入。在孩子乳牙长齐后，可做一次口腔检查。便于及早发现口腔疾患。正常宝宝可半年检查一次，发现蛀牙要及早填补，防止龋病深入，侵犯牙髓或感染牙根周围组织，引起根尖周围炎症。早些发现龋齿，补上窟窿，是防止龋洞扩大的好办法。。不过也有的医生不给补龋洞，是因为宝宝还没有感到疼痛，乳牙不久就要换的原因，这样的话，每隔3-4月检查一次。",

        ],[
          "宝宝出生后1年内(1.5个月～11个月)所有乳牙釉质矿化完成，出生后2年内(6个月～24个月)所有乳牙萌出。2岁半～3岁左右：乳牙出齐，上下各10颗，左右对称，共20颗。宝宝的20颗乳牙陆续萌出了，逐渐完成了由流质食物转为半流质食物到正常饮食的过程，饮食结构和习惯逐渐规律化。",
        ],
      ],
      [
        [
          "清洁概述：锻炼孩子自己刷牙的能力的同时培养孩子对刷牙兴趣，利用含氟牙膏预防龋齿。所需用品：适合孩子年龄的牙刷、牙膏、漱口杯、棉签。 技术指导：一开始就应该注意让孩子掌握正确的刷牙方法，避免过多的拉锯式的横刷法。错误的刷牙方法不但不能把牙齿刷干净，还容易造成牙齿脆弱，以后孩子使用稍硬的牙刷刷牙，牙龈就会疼痛。正确的刷牙方法：把牙膏挤到牙刷上（黄豆粒大小就可以），顺牙缝由上而下、由下而上地竖刷。上下、内外都是顺着牙根向牙尖刷，牙合面可以横刷。每次刷牙至少需要3分钟，每个面要刷15～20次。刷完后用清水将牙膏全部漱出。最后由妈妈检查，没刷干净的地方，妈妈用蘸过清水的棉签轻轻擦拭。",
          "  牙刷的选择:根据孩子乳牙的情况，选择适合的牙刷。如果牙刷的毛出现弯曲，就要更换新牙刷，最迟6到8个星期换一次。 儿童专用牙刷：小乳牙出齐时使用，可为宝宝选用保健牙刷练习刷牙。它的特点是：刷头小，长度以相当于四颗门牙的宽度为宜，在口内转动灵活，可以刷到所有牙齿的表面；刷毛细而可以进入它间隙柔；刷毛经过磨圆，不刺激齿龈，不损伤牙齿；牙刷柄长短适中，牙刷柄表面最好有一层防滑贴面，易于孩子抓握。",
          "牙刷的保养: 每次刷牙后，牙刷应用流动的水冲洗。因为食物残渣、细菌都会粘附在牙刷上。如果不彻底清洗牙刷，下一次刷牙时没有得到清理的细菌又重新回到口腔中去了。牙刷在两次使用之间必须保持干燥。否则细菌会在潮湿的环境中繁殖。如果牙刷没用多久就有分叉的现象，就表示刷牙太用力了，以后刷牙应该注意。牙膏的选择:选择孩子专用的牙膏。宝宝不能使用成人牙膏，不然会造成口腔菌群发生改变或是某种细菌产生耐药性，对口腔健康产生影响。要选择口感温和以及少泡沫的牙膏，因为这些牙膏不会对儿童的口腔粘膜和味觉产生不良影响。3岁以上的孩子可使用含氟牙膏。因为含氟牙膏不仅能够抑制细菌的生长，而且可以提高牙齿的硬度，增强牙齿的抗酸能力，预防龋齿。但是3-6岁应在大人指导下慎重使用，不得将牙膏吞进腹中，刷完牙后要把牙膏漱干净。 一定注意牙膏使用量，每次只使用黄豆粒般大小，最多不超过1厘米。高氟地区的孩子，使用含氟牙膏时要先经过医生同意。",
          "漱口杯的选择：要选择做工精致，重量较轻的小杯子，尤其是杯口的处理应圆滑，不能划伤孩子的嘴唇。刷牙方法：  适合2-6岁儿童的刷牙方法是圆弧刷牙法，它简单易学，可以是家长帮助儿童刷牙时使用，也可以是儿童自己学习刷牙时使用。我们一般是从左上后牙的外侧面开始，刷牙时上下牙咬上，然后把牙刷轻轻的放在左上后牙的外侧面，从左上后牙，牙齿与牙龈交接的部位，开始向下画圈，至下颌牙齿与牙龈交界的位置，这样依次画圈向前进行刷牙，右侧牙外侧面重复相同的动作，从后牙到前牙。刷到前牙时，下牙可微微向前伸至上下前牙相对，继续圆弧画圈刷完前牙。 刷牙内侧面，可以从左侧上颌后牙开始，需要大张口，牙刷毛放置于左上后牙内侧面，然后前后往复短距离震颤，幅度一般1-2mm，依次前行至尖牙，以同样的方法，刷右上后牙内侧面，左侧下后牙内侧面，和右侧下后牙内侧面。 刷上颌前牙时，可将刷柄竖起，从左侧尖牙开始，上下往复震颤数次，从左至右依次前行至右侧尖牙。 刷牙齿的咬合面时，需要大张口，将刷毛垂直置于牙齿的咬合面，稍用力做前后短距离来回刷。刷牙需要注意，容易忽略的地方有：上颌后牙的外侧面、下颌牙齿的内侧面，以及我们每一侧牙最后的这个位置。如果帮助儿童刷牙，家长可位于儿童的右后方，并根据儿童的不同年龄和身高，采取抱姿，坐姿或者站姿。",

        ],[
          "3-6岁要养成合理的饮食习惯   (1)力求食品营养均衡、多样化； （2）科学合理，利用零食。多吃坚果及水果类的零食，少吃含糖食物，而且注意不要让零食影响到孩子正常的一日三餐，在吃完零食后及时清洁口腔。（3）避免睡前饮食，除了白开水外，不要再进食。（4）多吃富含纤维有一定硬度的固体食物，锻炼孩子的咀嚼功能。同时，也应该帮助孩子养成良好的口腔卫生习惯（1）早晚刷牙，饭后漱口，吃零食物后立即漱口。（2）牙刷一般三个月左右更换。如果从牙刷的背面能够看到弯曲的刷毛需要更换新牙刷。（3）刷牙后要把牙刷洗干净刷头向上放在通风干燥的地方。（4）牙缝、磨牙咬合面、牙齿与牙龈的邻接部位，容易发生的龋坏，给孩子刷牙时一定要按照正确的刷牙方法观察，并刷干净这几个部位。",

        ],[
          "宝宝在3岁左右乳牙已经出齐，会有20颗小乳牙。而且在随后的两三年中，宝宝吃饭会充分利用小乳牙，直到6岁以后，会进入到恒牙替换乳牙阶段，此时也是宝宝第二长牙期开始了。儿童最好从3~4岁开始，每半年涂氟一次，直到6岁为止。氟化泡沫防龋齿是运用泡沫的形式，使牙齿表面和缝隙附着泡沫，释放氟化物，防龋齿。一般情况下，所有的孩子都适合做氟化泡沫预防龋齿。不过在做儿童牙齿涂氟的时候，一定要在专业的牙科医生指导下操作。",
        ],
      ],
      [
        [
          "清洁概述： 6岁以上的孩子,可以和成人一样学习“巴氏刷牙法”，尽量做到独立刷牙。1、正确的刷牙流程（1）先把牙刷放在水中浸泡十几秒，让刷毛变软，这样对牙齿的磨损小。（2）然后含水漱口，挤牙膏。（3）开始刷牙。对于咀嚼面用横刷法，来回拉锯动作。对于牙齿的内外两面（即舌面和颊面）用竖刷法，刷上牙时，先将牙刷的刷毛轻放在牙龈与牙齿的交界处，然后通过手腕的上下活动像用梳子一样，刷毛自牙龈顺着牙缝向下刷，在同一部位反复数次；刷下牙时则同样的方法从下往上刷，这样可以把牙缝中的食物残渣和牙菌斑清洁掉，不容易产生牙结石。对于门牙的内侧，要把牙刷竖起来，顺着牙缝刷。刷牙无需用力。（4）刷牙途中不要把泡沫吐掉。 （5）刷牙后，含着泡沫用力漱口2分钟，然后再吐掉。 （6）用水漱口。 ",
          "2、专家建议让孩子养成三餐饭后以及睡前刷牙，或每天至少两次刷牙吃过零食后随时漱口的好习惯。3、口腔医生建议使用牙线，因为牙签太粗无法穿过牙齿的邻接点，反复使用还会使牙龈不断萎缩，造成牙缝变大；而牙线是可以完全穿过牙齿的邻接点，帮助剔除食物残渣的，不仅不影响牙龈健康，而且清洁方便。牙刷的选择:根据孩子牙齿的情况，选择适合的牙刷。如果牙刷的毛出现弯曲，就要更换新牙刷，最迟6到8个星期换一次。 选用儿童专用牙刷，尽量选择软毛的牙刷，因为硬毛的牙刷如果刷牙力度较大，容易损伤牙齿颈部的牙釉质，从而造成牙齿敏感。牙刷的保养:每次刷牙后，牙刷应用流动的水冲洗。因为食物残渣、细菌都会粘附在牙刷上。如果不彻底清洗牙刷，下一次刷牙时没有得到清理的细菌又重新回到口腔中去了。 牙刷在两次使用之间必须保持干燥。否则细菌会在潮湿的环境中繁殖。 如果牙刷没用多久就有分叉的现象，就表示刷牙太用力了，以后刷牙应该注意。", 
          "牙膏的选择:选择含氟量较低的儿童含氟牙膏。含氟牙膏不仅能够抑制细菌的生长，而且可以提高牙齿的硬度，增强牙齿的抗酸能力，预防龋齿。7岁以上孩子基本可以独立使用含氟牙膏，注意不要将牙膏吞进腹中，刷完牙后要把牙膏漱干净。不要使用成人牙膏，不然会造成口腔菌群发生改变或是某种细菌产生耐药性，对口腔健康产生影响。要选择口感温和以及少泡沫的牙膏，因为这些牙膏不会对儿童的口腔粘膜和味觉产生不良影响。 一定注意牙膏使用量，每次不超过1厘米。高氟地区的孩子，使用含氟牙膏时要先经过医生同意。漱口杯的选择：要选择做工精致，重量较轻的小杯子，尤其是杯口的处理应圆滑，不能划伤孩子的嘴唇。刷牙方法：最有效的刷牙方法——“巴氏刷牙法”，巴氏刷牙法又称龈沟清扫法或水平颤动法。 按牙医通俗的解释就是，把刷毛插进牙缝里刷。  1.刷牙时选择软毛牙刷，将牙刷与牙长轴呈45°角指向根尖方向。  2.按牙龈-牙交界区，使刷毛一部分进入龈沟，一部分铺于龈缘上，并尽可能伸入邻间隙内。  3.用轻柔的压力，使刷毛在原位作前后方向短距离的水平颤动10次。4.颤动时牙刷移动仅约1毫米，每次刷2~3个牙。 5.只要循序的刷便不会有遗漏，每个区域刷30秒左右。 6.刷完所有牙齿后，轻轻的刷舌头表面，清水漱口就大功告成啦。",

        ],[
          "6~12岁期间是换牙期，乳牙会陆续发生理性自动脱落，到12岁左右全部被恒牙替代，孩子以后的牙齿是否整齐，这个时期相当关键。保护孩子的牙齿应做到以下几点：（1）让孩子养成良好的饮食习惯，克服偏食，注意营养的全面性和多摄入含钙质高的食物，同时也应该避免饮食过精，导致牙齿咀嚼功能下降。 （2）每天坚持刷牙，在吃完含糖较多的食物后注意清洁口腔。 （3）让孩子改掉舔牙齿等坏习惯。孩子在换牙期间常用舌头舔松动的乳牙或新长出的恒牙，这样牙齿之间会出现缝隙。很多小学生喜欢把铅笔等硬物放在嘴巴里咬着，容易形成牙齿局部的小开合畸形。由于换牙期的乳牙缺失，孩子会用另一边吃饭，如果时间长了家长不予以矫正会造成面部左右发育的“不对称”。（4）定期带儿童看牙医。儿童在换牙期时可能会出现较多的口腔问题，6~12岁的儿童至少每隔半年到医院牙科检查一次。",

        ],[
          "    儿童换牙开始时间一般在6岁左右。第一颗乳牙的生理性脱落多数发生在6岁左右，但也有早在4岁多，或者迟至7-8岁的，不必担心。自然脱落的乳牙没有根，脱落面呈蚕食状，儿童6岁左右紧靠最i后一个乳磨牙的后方长出第一个恒磨牙,也叫六龄磨牙；比下中切牙的长出稍早或同时,6岁左右乳下中切牙脱落,恒下中切牙长出,7—8岁时乳上中切牙脱落,恒上中切牙长出,乳下侧切牙脱落,恒下侧切牙长出；8—9岁乳上侧切牙脱落,恒上侧切牙长出；9—12岁第一,二乳磨牙脱落,第一,二双尖牙长出；10—12岁乳尖牙脱落,恒尖牙长出。 一般儿童第一颗牙齿的脱落时间在6-7岁之间。换牙过早通常是由于孩子的牙齿受过外伤而脱落，比如牙齿受到磕碰；也可能是由于某些口腔疾病所致，比如牙齿有炎症、龋坏等。如果儿童已经过了7岁而还没有一颗牙齿脱落，应带儿童去医院口腔科检查。换牙过晚，则可能是孩子的身体内部出了问题，比如恒牙先天缺失，导致乳牙脱落的时间太晚。但由于孩子个体差异很大，所以必须经过医生临床观察后才能确定。",
          "    牙齿松动脱落的过程一般不疼，但伴随着乳牙开始脱落，儿童的牙齿也就长出来了，这时可能会造成牙龈肿胀，使儿童抱怨牙痛。如果儿童疼痛得比较严重，需要去看牙医，由医生决定是否需要消炎止痛等。换牙毕竟需要一个过程，期间，儿童可能会抱怨没法嚼东西，但即使儿童吃饭不香，也要保证合理均衡的饮食，这时妈妈可以做一些蔬菜汤、肉汤等容易咀嚼吞咽的食物，以保证身体所需，同时，鼓励儿童坚持刷牙，清洁口腔。要特别保护儿童6岁左右长出的第一颗恒磨牙—六龄磨牙，因为它对整个口腔的牙齿有定位和定高的作用，对儿童颌骨和面部的发育有很大影响，对于其它恒牙的萌出以及排列整齐与否也起了重要的作用。",

        ],
      ],[
        [

          "清洁概述：12岁以上的孩子,可以和成人一样学习“巴氏刷牙法”，每天独立清洁牙齿。1、正确的刷牙流程（1）先把牙刷放在水中浸泡十几秒，让刷毛变软，这样对牙齿的磨损小。（2）然后含水漱口，挤牙膏。（3）开始刷牙。对于咀嚼面用横刷法，来回拉锯动作。对于牙齿的内外两面（即舌面和颊面）用竖刷法，刷上牙时，先将牙刷的刷毛轻放在牙龈与牙齿的交界处，然后通过手腕的上下活动像用梳子一样，刷毛自牙龈顺着牙缝向下刷，在同一部位反复数次；刷下牙时则同样的方法从下往上刷，这样可以把牙缝中的食物残渣和牙菌斑清洁掉，不容易产生牙结石。对于门牙的内侧，要把牙刷竖起来，顺着牙缝刷。刷牙无需用力。（4）刷牙途中不要把泡沫吐掉。（5）刷牙后，含着泡沫用力漱口2分钟，然后再吐掉。 （6）用水漱口。 ",
          "2、专家建议让孩子养成三餐饭后以及睡前刷牙，或每天至少两次刷牙吃过零食后随时漱口的好习惯。3、口腔医生建议使用牙线，因为牙签太粗无法穿过牙齿的邻接点，反复使用还会使牙龈不断萎缩，造成牙缝变大；而牙线是可以完全穿过牙齿的邻接点，帮助剔除食物残渣的，不仅不影响牙龈健康，而且清洁方便。 牙刷的选择:根据孩子牙齿的情况，选择适合的牙刷。如果牙刷的毛出现弯曲，就要更换新牙刷，最迟6到8个星期换一次。 选用儿童专用牙刷，尽量选择软毛的牙刷，因为硬毛的牙刷如果刷牙力度较大，容易损伤牙齿颈部的牙釉质，从而造成牙齿敏感。",
          "牙刷的保养:每次刷牙后，牙刷应用流动的水冲洗。因为食物残渣、细菌都会粘附在牙刷上。如果不彻底清洗牙刷，下一次刷牙时没有得到清理的细菌又重新回到口腔中去了。牙刷在两次使用之间必须保持干燥。否则细菌会在潮湿的环境中繁殖。如果牙刷没用多久就有分叉的现象，就表示刷牙太用力了，以后刷牙应该注意。牙膏的选择:可以使用一般的含氟牙膏。含氟牙膏不仅能够抑制细菌的生长，而且可以提高牙齿的硬度，增强牙齿的抗酸能力，预防龋齿。12岁以上孩子可以独立使用含氟牙膏，注意不要将牙膏吞进腹中，刷完牙后要把牙膏漱干净。并且一定注意牙膏使用量，不要挤出过量牙膏。   高氟地区的孩子，使用含氟牙膏时要先经过医生同意。漱口杯的选择：要选择做工精致，重量较轻的小杯子，尤其是杯口的处理应圆滑，不能划伤孩子的嘴唇。",
          "刷牙方法： 最有效的刷牙方法——“巴氏刷牙法”，巴氏刷牙法又称龈沟清扫法或水平颤动法。 按牙医通俗的解释就是，把刷毛插进牙缝里刷。 1.刷牙时选择软毛牙刷，将牙刷与牙长轴呈45°角指向根尖方向。 2.按牙龈-牙交界区，使刷毛一部分进入龈沟，一部分铺于龈缘上，并尽可能伸入邻间隙内。 3.用轻柔的压力，使刷毛在原位作前后方向短距离的水平颤动10次。 4.颤动时牙刷移动仅约1毫米，每次刷2~3个牙。5.只要循序的刷便不会有遗漏，每个区域刷30秒左右。6.刷完所有牙齿后，轻轻的刷舌头表面，清水漱口就大功告成啦。",
        ],[
          "脱掉乳牙后，重新长出来的牙齿会伴随我们一生，因此，我们在12岁后一定要做好牙齿的保护工作。（1）学会正确刷牙，每天早晚刷两次牙，每顿饭后要漱口。 （2）养成良好的口腔卫生保健习惯，少吃甜食、碳酸饮料。摄入糖过多或饮用过多碳酸饮料，会导致牙齿脱矿，引发龋齿或产生牙齿敏感。（3）早期进行口腔疾病的干预，如：提倡使用含氟牙膏，对儿童牙齿进行窝沟封闭，重点保护好“六龄牙“（第一恒磨牙）（4）定期进行口腔健康检查，每年至少一次，提倡每年洁牙一次，以保持牙齿坚固和牙周健康。",

        ],[
          "12岁一般结束换牙期。12-13岁长齐28颗牙齿（智齿因人而异）。12-13岁的儿童开始长第二磨牙；最后的第三磨牙，即智齿，要到儿童17岁后才开始长出，而且维持生长的时间会到21岁，因人而异。",

        ],
      ],
    ],
    choosen_age_txt: ["0~半岁", "半岁~1岁半", "1岁半~3岁", "3岁~6岁", "6岁~12岁", "12岁以上"],
    choosen_butt_age: undefined,
    choosen_butt_func: undefined,
    choosen_func_txt: ["清洁", "保护", "发育"],
    butt_co: [{
      co: "white",
      bco: "",
    }, {
      co: "white",
      bco: "",
    }, {
      co: "white",
      bco: "",
    }],
    theme_color: "",
    jiaonangHeight: 42, // data中定义
    statusBarHeight: getApp().globalData.statusBarHeight, // 导航栏的高度

  },

  back: function () {
    wx.navigateBack({
      delta: 1,
    })
  },

  choose_func: function (e) {
    const new_choosen_func = parseInt(e.currentTarget.id)
    // console.log(new_choosen_func)
    app.globalData.choosen_butt_func = new_choosen_func
    this.onShow()
    console.log(this.data)
  },

  getThemeButtonColor: function () {
    for (let i = 0; i < 3; i++) {
      this.setData({
        [`butt_co[${i}].bco`]: app.globalData.theme_color,
        [`butt_co[${i}].co`]: "white"
      })
    }
  },

  setThemeButtonColor: function () {
    const myIndex = this.data.choosen_butt_func
    this.setData({
      [`butt_co[${myIndex}].co`]: app.globalData.theme_color,
      [`butt_co[${myIndex}].bco`]: "white"
    })
  },



  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
    var that = this;
    wx.getMenuButtonBoundingClientRect( //获取胶囊的干度及其他参数
      {
        success: e => {
          that.data.jiaonangHeight = e.height
        }
      }
    )

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
    this.setData({
      theme_color: app.globalData.theme_color,
    })
    this.getThemeButtonColor()
    this.setData({
      choosen_butt_func: app.globalData.choosen_butt_func,
      choosen_butt_age: app.globalData.choosen_butt_age,
    })
    this.setThemeButtonColor()
    // console.log(this.data)
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})